{
 "class_name": "Sequential",
 "config": {
  "name": "sequential_71",
  "layers": [
   {
    "class_name": "InputLayer",
    "config": {
     "batch_input_shape": [
      null,
      784
     ],
     "dtype": "float32",
     "sparse": false,
     "ragged": false,
     "name": "dense_142_input"
    }
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_142",
     "trainable": true,
     "batch_input_shape": [
      null,
      784
     ],
     "dtype": "float32",
     "units": 784,
     "activation": "gelu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": {
      "class_name": "L1",
      "config": {
       "l1": 9.999999747378752e-06
      }
     },
     "kernel_constraint": null,
     "bias_constraint": null
    }
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_143",
     "trainable": true,
     "dtype": "float32",
     "units": 784,
     "activation": "sigmoid",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    }
   }
  ]
 },
 "keras_version": "2.8.0",
 "backend": "tensorflow"
}